cases/square2D_VIV_multiprocessing/env05/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.0125;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.0125;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;
maxCo           4;
maxDeltaT       0.001;

libs ("libinletParabolicVelocity.so" "libjetParabolicVelocity.so" "libincrementalJetParabolicVelocity.so" "libincrementalJetUniVelocity.so");
// ************************************************************************* //

functions
{
    //#includeFunc  CourantNo
   // #includeFunc  residuals
    #includeFunc  vorticity
    #includeFunc  forceCoeffsIncompressible
    #includeFunc  forcesIncompressible
    //#includeFunc  yPlus
    #includeFunc  probes
    //#includeFunc  moving_probes
}

